Johns Hopkins University - Ruby on Rails Web Development Specialization/Johns Hopkins University - Rails with Active Record and Action Pack/assignments/ActionPack/todolists/app/controllers/todo_items_controller.rb

  def index
    @todo_items = TodoItem.all
---
SELECT "todo_items".* FROM "todo_items"

  def create
    @todo_item = TodoItem.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save
---
INSERT INTO "todo_items" ("title", "description", "completed", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Random"], ["description", ""], ["completed", "f"], ["due_date", "2019-08-02"], ["created_at", "2019-08-02 14:05:25.395413"], ["updated_at", "2019-08-02 14:05:25.395413"]]

    def set_todo_item
      @todo_item = TodoItem.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT 1  [["id", nil]]